# MaskCoincidentLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..MaskCoincidentLines Property
PrintParameters Class See Also
---
Indicates whether to mask coincident lines when printing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool MaskCoincidentLines { get; set; }
```

Visual Basic
---
```text
Public Property MaskCoincidentLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool MaskCoincidentLines {
	bool get ();
	void set (bool value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace